{"source": "cordis", "mime_type": "URL", "language": "en", "id": "cordis:article:10000", "id_alias": "CORDIS:article:10000", "title": "Action plan for the safe use of the Internet", "abstract": "The European Commission, DG XIII, has published a call for expressions of interest relating to technical assistance with the proposed action plan on promoting safe use of the Internet. This call has the objective of enabling the Commission to compile a list of potential evalua...", "text": "\n\nThe European Commission, DG XIII, has published a call for expressions of interest relating to technical assistance with the proposed action plan on promoting safe use of the Internet. This call has the objective of enabling the Commission to compile a list of potential evaluators. The tasks involved would include:\n\n- Technical assistance with evaluating proposals submitted in response to calls under the action plan;\n- Technical assistance in the review of projects supported under the action plan;\n- Technical assistance in the context of the mid-term review of the action plan.\n\nThe proposed action plan, which is expected to be approved by the Council in May, aims to combat the circulation of illegal and harmful material on the Internet. The proposal envisages the creation of hot lines, self-regulation and content-monitoring schemes, the promotion of compatible and interoperable rating schemes and awareness measures.\n\nThe Commission will invite selected contractors from the list established as a result of this call to perform these tasks as and when required.\nPlease submit expressions of interest to the following address:\n\nEuropean Commission\nDG XIII - Telecommunications, information market and exploitation of research\nInternet \"Programme Evaluators\"\nrue Alcide de Gasperi (EUFO 1179)\nL-2920 Luxembourg\nFax +352-430133190\nE-mail: evaluators@echo.lu\n\nFurther information on the action plan may be accessed on the I'M Europe Web server, at:\n\nhttp://www.echo.lu/\n\n\n", "date": "1998-03-23", "collection": "news;News", "link_origin": "https://cordis.europa.eu/article/rcn/10000", "other": {"crc": "9b6da1e4915935edbd517442f3948202421fbaf2618d9a56386b6a58e33cf70d","project_piknus":"true"}}