{"source": "cordis", "mime_type": "URL", "language": "en", "id": "cordis:event:19011", "id_alias": "CORDIS:event:19011", "title": "Ocean energy thematic network to present results", "abstract": "A conference on future research and development (R&D) in the ocean energy sector, organised by an EU funded thematic network, will take place in Brighton, UK on 29 October.\n\nThe thematic network on wave energy was funded under the Fifth Framework programme's 'Energy, environme...", "text": "A conference on future research and development (R&D) in the ocean energy sector, organised by an EU funded thematic network, will take place in Brighton, UK on 29 October.\n\nThe thematic network on wave energy was funded under the Fifth Framework programme's 'Energy, environment and sustainable development' programme. The conference will present the results of the three year project on wave and tidal energy, which began in April 2000. \n\nThe network comprises 14 organisations from across Europe, which are investigating a wide range of issues relating to wave and tidal energy. The result is a comprehensive overview of wave and tidal energy and this conference is the first time that these results are being presented.\n\nThe rationale behind Wave Net is to overcome the fragmentation in wave and tidal energy R&D. Although it is being carried out in many EU countries, much of it is in isolation. The network members believe there is a need to build on the existing wave and tidal energy activities by forming a thematic network for fostering such an exchange.\n\nThe conference would be relevant to anybody involved in ocean energy development - researchers, device developers, systems manufacturers, electrical utilities, government agencies and companies involved in the marine businessFor further information, please consult the following web address:\nhttp://www.wave-energy.net/news\nor contact:\nTara Clipperton\nTel: +44 1235 433770\nE-mail: tara.clipperton@aeat.co.uk\n", "date": "2002-09-27", "collection": "event;Event", "reference": "FP5", "link_origin": "https://cordis.europa.eu/event/rcn/19011", "other": {"crc": "31ad6e7ca4215be9211aa883abc74090c07c97108420c803026335967997c396","project_piknus":"true"}}