{"source": "cordis", "mime_type": "URL", "language": "en", "id": "cordis:programme:706651", "id_alias": "CORDIS:programme:706651", "reference": "HORIZON", "title": "Monitoring and supervising system for exploration and future exploitation activities in the deep sea (RIA)", "abstract": "The global economic interest in deep-sea mineral resources has been growing and so are the concerns with the negative impacts on the deep sea ecosystems if mining activities start. The expected increase of the global demand for metals needed for the energy transition might...", "text": "<p><span>The global economic interest in deep-sea mineral resources has been growing and so are the concerns with the negative impacts on the deep sea ecosystems if mining activities start. The expected increase of the global demand for metals needed for the energy transition might become a driver to initiate commercial deep sea mining, paved by the technological advancements. However, before any deep-sea mining activities start, the environmental impacts, and how to mitigate them, need to be well understood; a robust legal framework needs to be in place and a reliable and transparent monitoring and supervising system for the activities taking place in the deep-sea has to be ready. For the sake of transparency and to properly assess the environmental consequences of the activities taking place in the deep sea over time, it is crucial to develop and to put in place a system capable of continuous monitoring, of the exploration and exploration activities, so the permitting and supervising authorities can access it remotely and at any moment. </span></p><p><span>The actions should design and develop a reliable and robust monitoring and inspection system for the exploration and future exploitation activities in the deep-sea. Before the monitoring and inspection systems are used a forecasting of the impact on the environment of these activities should be performed. Therefore, projects should deliver appropriate technological and systemic solutions for such forecasting assessments.</span></p><p><span>A monitoring and inspection system for the activities taking place in the deep sea is very complex because the activities take place in remote areas, in the middle of the ocean, and in an extreme environment, deep water column and consequent pressure and fragile ecosystems. The system needs to be fully transparent and capable of monitoring all relevant environmental parameters and at the same time protect business confidentiality. Due to the complexity of such system, the project has to be developed by a multidisciplinary team, looking at environmental, legal and technological solutions. Any bathymetry, geology, seabed habitats, chemistry, biology and physics marine data collected, in particular at the testing phase, should be INSPIRE[[Directive 2007/2/EC of the European Parliament and of the Council of 14 March 2007 establishing an Infrastructure for Spatial Information in the European Community (INSPIRE)]] compliant and made available through the European Marine Observation and Data Network (EMODnet).</span></p><p><span>For each of the three mineral deposits (polymetallic nodules, manganese crusts and sulphide deposits) found at different depth ranges of the ocean the project will</span></p><ol level=\"\"0\"\">  <li>I<span>dentify all the bio-chemical-physical parameters to be monitored at the bottom of the sea, along the water column and at the surface; </span></li><li>I<span>dentify all technical requirements needed for a real time monitoring of all parameters at the bottom, along the water column and surface, including the use of satellite data (Global Navigation Satellite System and Copernicus’ satellite constellation) and to make it continuously available for remote access; </span></li><li><span>Identify existing technological solutions and develop new ones to fulfil the technical requirements; </span></li><li>D<span>esign and develop the architecture of the system in view of incorporating the monitoring parameters, the technical requirements and the legal constrains; </span></li><li><span>Develop a trial version of the system and test it.</span></li> </ol><p><span><span>The project should build on and explore synergies with previous and ongoing EU funded projects on environmental impacts and environmentally friendly technologies for exploration and exploitation of the deep sea. The project should cooperate closely with the International Seabed Authority, notably with its Legal and Technical Commission, and take into account the legal framework for the seabed and ocean floor and subsoil thereof beyond the limits of national jurisdiction. The project should take into account the developments of the international legally binding instrument under the United Nations Convention on the Law of Sea on the conservation and sustainable use of marine biological diversity of areas beyond national jurisdiction.</span></span></p><p>In this topic the integration of the gender dimension (sex and gender analysis) in research and innovation content is not a mandatory requirement</p>", "date": "2022-06-27", "collection": "topic;Topic", "link_origin": "https://cordis.europa.eu/programme/rcn/706651", "other": {"crc": "f70995095057453d92b5ea07725d4273aacb90ae7dc015a51a9ac057eeeee28a","project_piknus":"true"}}