{"source": "cordis", "mime_type": "URL", "language": "en", "id": "cordis:programme:706652", "id_alias": "CORDIS:programme:706652", "reference": "HORIZON", "title": "Innovative solutions for efficient use and enhanced recovery of mineral and metal by-products from processing of raw materials (IA)", "abstract": "Actions should develop sustainable systemic solutions through industrially- and user driven multidisciplinary consortia covering the relevant value chain of non-fuel, non-food raw materials.Actions should develop energy-, material- and cost-efficient new sustainable mineral...", "text": "<p><span>Actions should develop sustainable systemic solutions through industrially- and user driven multidisciplinary consortia covering the relevant value chain of non-fuel, non-food raw materials.</span></p><p><span>Actions should develop energy-, material- and cost-efficient new sustainable mineral processing and/or metallurgical technologies and processes to increase the selectivity and the recovery rates of valuable by-products</span>[[<span>The term \"\"by-products\"\" should be interpreted here as the constituents usually accompanying the major component(s) of a raw material at low concentrations.</span>]]<span>, particularly critical raw materials</span>[[<span>EU list of critical raw materials 2020 – add link when published</span>]]<span>. The importance of the targeted raw material by-products for the EU economy should be duly demonstrated in the proposal. Recycling of end-of-life products is excluded from this topic.</span></p><p><span>Proposals submitted under this topic should include a business case and exploitation strategy, as outlined in the introduction to this Destination. For TRLs 6-7, a credible strategy to achieve future full-scale manufacturing in the EU is expected, indicating the commitments of the industrial partners after the end of the project.</span></p><p>Actions should facilitate the market uptake of solutions developed through industrially- and user-driven multidisciplinary consortia covering the relevant value chain and should consider standardisation aspects when relevant.</p><p><span>Actions should justify the relevance of selected pilot demonstrations in different locations within the EU (and also outside if there is a clear added value for the EU economy, industry and society).</span></p><p>Actions should also contribute to improving the awareness of relevant external stakeholders and the general public across the EU about the importance of raw materials for society, the challenges related to their supply within the EU and about proposed solutions which could help to improve society's acceptance of and trust in sustainable raw materials production in the EU.</p><p><span><span>Actions should envisage clustering activities with other relevant selected projects for cross-projects co-operation, consultations and joint activities on cross-cutting issues and share of results as well as participating in joint meetings and communication events. To this end proposals should foresee a dedicated work package and/or task, and earmark the appropriate resources accordingly.</span></span></p><p>In this topic the integration of the gender dimension (sex and gender analysis) in research and innovation content is not a mandatory requirement.</p>", "date": "2022-06-27", "collection": "topic;Topic", "link_origin": "https://cordis.europa.eu/programme/rcn/706652", "other": {"crc": "0c030b92da9ce52fd34d14c06fa0d81ac30fd100f15983f48dbb37511fbc35ed","project_piknus":"true"}}