{"source": "cordis", "mime_type": "URL", "language": "en", "id": "cordis:programme:706654", "id_alias": "CORDIS:programme:706654", "reference": "HORIZON", "title": "Developing digital platforms for the small scale extractive industry (IA)", "abstract": "Actions should develop digital platforms that integrate Earth Observation data, in situ data and data modelling, to improve data management and decision making during the extractive process. Proposals are encouraged to make use of, but not limited to, existing EU and Member...", "text": "<p>Actions should develop digital platforms that integrate Earth Observation data, in situ data and data modelling, to improve data management and decision making during the extractive process. Proposals are encouraged to make use of, but not limited to, existing EU and Member States data infrastructures.</p><p>These digital platforms should scale up to the increased data volumes of the extractive activities, incorporating assimilation techniques and interoperability best practices, automation, systemization and integrated web-based services, and be brought into pre-operational service provision, going beyond the demonstration phase.</p><p>Actions should contribute to digitalize the extractive industries operations and, being INSPIRE<span>[[Directive 2007/2/EC of the European Parliament and of the Council of 14 March 2007 establishing an Infrastructure for Spatial Information in the European Community (INSPIRE)]]</span> compliant, help data gathering at EU level for evaluating the performance and competitiveness of extractive industries.</p><p>These digital platforms should contribute to increase the dialogue between the extractive industry and EU citizens, raising awareness about the impact of raw materials on the value chains and society well-being and reinforcing the commitment of the industry to protect human health and natural eco-systems.</p><p><span>Proposals submitted under this topic should include a business case and exploitation strategy, as outlined in the introduction to this Destination. For TRLs 6-7, a credible strategy to achieve future full-scale manufacturing in the EU is expected, indicating the commitments of the industrial partners after the end of the project.</span></p><p><span>Building on past projects, the actions should provide practical and easily applicable capacity building and training materials for a better environmental and social management of active operations. They should also include exchange of best practices and capacity building for the effective monitoring of extraction sites by competent authorities.</span></p><p>Actions should envisage clustering activities with other relevant selected projects for cross-projects co-operation, consultations and joint activities on cross-cutting issues and share of results as well as participating in joint meetings and communication events. To this end proposals should foresee a dedicated work package and/or task, and earmark the appropriate resources accordingly.</p><p><span><span>Actions should also contribute to improving the awareness of relevant external stakeholders and the general public across the EU about the importance of raw materials for society, the challenges related to their supply within the EU and about proposed solutions which could help to improve society's acceptance of and trust in sustainable raw materials production in the EU.</span></span></p><p><span>Proposals should take into account issues of accessibility and inclusivity, such as age, gender, disability, and socio-economic background.</span></p>", "date": "2022-06-27", "collection": "topic;Topic", "link_origin": "https://cordis.europa.eu/programme/rcn/706654", "other": {"crc": "20668ae407fb3c3e9e8aca209b81e68ccf65217a272d29da97e1ac6d084677b9","project_piknus":"true"}}