{"source": "cordis", "mime_type": "URL", "language": "en", "id": "cordis:programme:706653", "id_alias": "CORDIS:programme:706653", "reference": "HORIZON", "title": "Climate Neutral and Circular Innovative Materials Technologies Open Innovation Test Beds (IA)", "abstract": "The following specific activities should be considered:Establish Open Innovation Test Beds (OITB) by upgrading existing or developing new materials facilities and pilot lines, and made available services for the design, development, testing, regulatory and environmental...", "text": "<p>The following specific activities should be considered:</p><ul level=\"\"0\"\"><li>Establish Open Innovation Test Beds (OITB) by upgrading existing or developing new materials facilities and pilot lines, and made available services for the design, development, testing, regulatory and environmental assessment and upscaling to industry and interested parties, specially SMEs;</li><li>Specific focus will be given to the sustainability of the ecosystem by designing new funding instruments that would complement the already existing ones and provide further support for industrial uptake of climate neutral and circular innovative materials technologies in key strategic value chains;.</li><li>Proposals should include actions designed to facilitate cooperation with other projects, to enhance user involvement and to reuse other projects results;</li><li>Open access at fair conditions and cost as well as outreach and dissemination across Europe, based on a distinct methodology;</li><li>Demonstrate measurable reduction of costs for product design, time-to-market and regulatory compliance by means of faster and cheaper evaluation of production process deviations. Relevant indicators and metrics, with baseline values, should be clearly stated in the proposal.</li> </ul><p>In order to avoid duplication, the work will be aligned with the third pillar on Open Innovation that will essentially focus on scaling up breakthrough and market-creating innovation by establishing a European Innovation Council, support the enhancement of European ecosystems of innovation and continued support to the European Institute of Innovation and Technology (EIT) OITB for: Clean hydrogen Technologies; Fuel cells and other alternative fuels; Carbon capture, storage and utilisation.</p><p><span>Proposals submitted under this topic should include a business case and exploitation strategy, as outlined in the introduction to this Destination.</span></p>", "date": "2022-06-27", "collection": "topic;Topic", "link_origin": "https://cordis.europa.eu/programme/rcn/706653", "other": {"crc": "d4c726cfe9de7b74006160240a87f2068c18e044973e4a3456b055bfec9fa6ef","project_piknus":"true"}}