{"source": "cordis", "mime_type": "URL", "language": "en", "id": "cordis:project:96954", "id_alias": "CORDIS:project:96954", "title": "SECURE: Science Education CUrriculum REsearch", "abstract": "The EU lags behind its global competitors when it comes to the number of MST graduates. A special effort is required to close this gap. The overall aim of the SECURE project is to make a significant contribution to a European knowledge-based society by providing relevant rese...", "text": "The EU lags behind its global competitors when it comes to the number of  MST graduates. A special effort is required to close this gap.  The overall aim of the SECURE project is to make a significant contribution to a European knowledge-based society by providing relevant research data that can help policy makers to improve MST curricula and their implementation throughout the EU in order to prepare children from an early age on for future careers in MST, whilst at the same time making MST more accessible and enjoyable for  all children so that they will keep a vivid interest in science and technology, and understand the importance of their societal role.\n\nSECURE will focus on the 5 – 13 age group, because the foundation for a revived interest in MST can best be laid at an early age, when children are most susceptible for the wonders of the world that surrounds them.\n\nA rigorous research programme conducted by the SECURE consortium will scrutinise and compare current  MST curricula for pupils aged 5, 8, 11 and 13  in the member states  as they are intended by the authorities, implemented by the teachers and perceived by the learners. The instruments used to this end will consist of a transnational comparative screening instrument for MST curricula, of teacher and learner questionnaires and of a lesson observation instrument.\n\nThe cornerstone of the valorisation strategy of the research outcomes will be the direct and active involvement of a transnational expert group of research and curriculum development institutions that will provide feedback as well as a direct access to policy makers.", "date": "2022-09-03", "link_related": ["https://cordis.europa.eu/article/rcn/166029"], "author": ["THOMAS MORE KEMPEN VZW", "UNIVERSITA DEGLI STUDI DI UDINE", "DIENST KATHOLIEK ONDERWIJS VAN HET BISDOM ANTWERPEN VZW", "Stichting Leerplanontwikkeling SLO", "HOGSKOLAN I GAVLE", "Jagiellonian University in Krakow", "THE NOTTINGHAM TRENT UNIVERSITY", "UNIVERSITAET GRAZ", "UNIVERSITY OF CYPRUS", "UNIVERZA V LJUBLJANI", "TECHNISCHE UNIVERSITAET DRESDEN"], "collection": "project;Project", "link_origin": "https://cordis.europa.eu/project/rcn/96954", "other": {"crc": "24e7cbf929149c3b4ca9c1fbbf2b658055de29411b0ecddc0d519d9d1e0d92ed"}}