{"source": "cordis", "mime_type": "URL", "language": "en", "id": "cordis:article:1000", "id_alias": "CORDIS:article:1000", "title": "Legal protection of databases", "abstract": "A Commission proposal for a Council Directive on the legal protection of databases (COM(92) 24 of 15.4.1992) aims to provide copyright protection in each Member State for databases as collections within the meaning of Article 2(5) of the Berne Convention for the Protection of ...", "text": "\n\nA Commission proposal for a Council Directive on the legal protection of databases (COM(92) 24 of 15.4.1992) aims to provide copyright protection in each Member State for databases as collections within the meaning of Article 2(5) of the Berne Convention for the Protection of Literary and Artistic Works (text of the Paris Act of 1971).\n\nA database shall be protected by copyright if it is original in the sense that it is a collection of works or materials which, by reason of their selection or their arrangement, constitutes the author's own intellectual creation. No other criteria shall be applied to determine the eligibility of a database for this protection. The copyright protection shall not extend to the works or materials contained in a database, irrespective of whether or not they are themselves protected by copyright; the protection of a database shall be without prejudice to any rights subsisting in those works or materials themselves.\n\nThe Member States shall provide for a right for the maker of a database to prevent the unauthorized extraction or re-utilization of its contents for commercial purposes, irrespective of the eligibility of the database for protection under copyright.\n\nFurther Articles of the proposal deal with authorship, incorporation of works or materials into a database, restricted acts and exceptions, unfair extraction of the contents of a database, terms of protection, remedies, beneficiaries of protection and the continued application of other legal provisions. It is proposed that Member States bring into force regulations and administrative provisions necessary to comply with the Directive by 1 January 1993.\n\n\n", "date": "1992-06-30", "link_related": ["https://cordis.europa.eu/article/rcn/1293", "https://cordis.europa.eu/article/rcn/5845", "https://cordis.europa.eu/article/rcn/1537"], "collection": "news;News", "link_origin": "https://cordis.europa.eu/article/rcn/1000", "other": {"crc": "c4df637aeb3889b87eb280510fe6d58a4c69ebbe1c1c14d107be3d6bcd5d86b3"}}