{"source": "cordis", "mime_type": "URL", "language": "en", "id": "cordis:article:100004", "id_alias": "CORDIS:article:100004", "title": "Tiny devices to feed advances in food safety and quality", "abstract": "Laboratory testing of agricultural produce in the wake of the food scares of the 1990s has made the food on European dinner tables safer than ever before. But, say a team of researchers, an even better job could be done by taking the laboratory to the farm, slaughter house or processing plant.", "text": "\n\nThe GoodFood project aims to do just that by using micro and nanotechnology to develop portable devices to detect toxins, pathogens and chemicals in foodstuffs on the spot. Food samples would no longer have to be sent to a laboratory for tests – a comparatively lengthy and costly procedure – but could be analysed for safety and quality at the farm, during transport or storage, in a processing or packaging centre or even in a supermarket.\n\n“The aim is to achieve full safety and quality assurance along the complete food chain,” explains Carles Cané, the coordinator of the IST programme-funded project at the National Microelectronics Centre in Spain.\n\nSensors used for screening \nThe tiny biomechanical and microelectronic sensors can be used to screen for virtually any pathogen or toxin in any produce, although the project partners are focusing their research on quality and safety analysis for dairy goods, fruit and wine.\n\nFor the dairy sector they are developing a device based on a fluorescent optical biosensor that measures the reaction of a probe coated with antibodies when it comes into contact with antibiotics present in milk or other dairy products. Though the use of antibiotics as growth enhancers is prohibited in dairy cattle in Europe, farmers are permitted to employ them to treat ailments affecting individual animals. These can enter the milk and could prove harmful to consumers - especially if they end up in baby food - by creating cumulative resistance to antibiotic treatments.\n\nChecking milk for antibiotic residues is typically carried out with a non-reusable litmus paper testing kit. An electronic device of the kind being developed by GoodFood would make the tests faster, cheaper and more accurate.\n\nThe same would be true, the project partners say, if a microelectronic device is used to detect pathogens such as salmonella and listeria bacteria in milk, cheese and other dairy products. The partners are therefore also developing a device using DNA biochips to detect pathogens - a technique that could also be applied to determine the presence of different kinds of harmful bacteria in meat or fish, or fungi affecting fruit. Other sensors based on an immunodiagnostic microarray will be developed to identify pesticides on fruit and vegetables.\n\nTo date detecting the presence of bacteria or pesticides in different foodstuffs has only been possible by sending samples, usually selected at random, to a laboratory and waiting hours or even days for the results. A portable device would not only accelerate the testing procedure, but would allow more tests to be carried out on more produce samples, increasing the overall safety of the food. \n\nImproving quality as well as safety\nImproving food safety is not the only goal of the project, however, which is also planning to use micro- and nano-sensors to increase food quality, with evident benefits not just for consumers but also farmers and processors.\n\nSensors that measure the quantity of oxygen and ethylene – a gas produced by fruit as it ripens - in fridges where unripe fruit is stored for months until it is ready to go on sale would give suppliers greater control over how well the produce is being maintained. Employed on the farm, sensors to measure environmental and climatic conditions would give farmers important information about their crops, especially when the sensors are connected wirelessly to an analysis system.\n\nThis and other systems developed by the project are being tested over the course of this year at a vineyard near Florence in Italy where the grapes due to be harvested in September will have grown under the watchful eye of the GoodFood sensors.\n\n“Wine making is a precise art and a difference of a few days in when the grapes are picked can make a huge difference in the quality of the wine,” the coordinator notes. \n\nWith the GoodFood system, the Florence vineyard owner can look forward to 2006 being an excellent vintage. In the future other farmers, processors and consumers will also benefit from better and safer food, with Cané expecting the project’s research to lead to commercial systems, initially for testing and monitoring more expensive foodstuffs such as wine and baby food and eventually for other produce.\n\nContact:\nCarles Cané\nCentro Nacional de Microelectrónica\nCampus UAB\nBellaterra\nSpain\nTel: +34-935947700\nMobile: +34 647 418 493\nEmail: carles.cane@cnm.es\nSource: Based on information from GoodFood\n\nPLEASE MENTION IST RESULTS AS THE SOURCE OF THIS STORY AND, IF PUBLISHING ONLINE, PLEASE HYPERLINK TO: http://istresults.cordis.lu/\n\n", "date": "2006-02-23", "collection": "news;News", "other": {"regions": ["Spain"], "crc": "be4780f5856539b0d66ed035781300b35ebabcfec9fbf35bf6d8d7ce7cd2fdd1","project_piknus":"true"}, "link_origin": "https://cordis.europa.eu/article/rcn/100004"}