{"source": "cordis", "mime_type": "URL", "language": "en", "id": "cordis:programme:706655", "id_alias": "CORDIS:programme:706655", "reference": "HORIZON", "title": "Sustainable and innovative mine of the future (IA)", "abstract": "Actions should contribute to applying, adapting and eventually developing big data technologies and Artificial Intelligence methodologies addressing mining industry requirements to deliver on the climate ambition of the European Green Deal. The challenge is to accelerate the...", "text": "<p><span>Actions should contribute to applying, adapting and eventually developing big data technologies and Artificial Intelligence methodologies addressing mining industry requirements to deliver on the climate ambition of the European Green Deal. The challenge is to accelerate the innovation in the mining sector necessary for the digital transformation. Actions should aim to develop new, enabling, operational solutions to improve capabilities and performance of the raw materials value chain: from in situ mineral exploration and permitting procedures, to mineral extraction and processing including recycling, as well as closure and post closure activities.</span></p><p>Actions should push the EU to the forefront of a safer, more sustainable and intelligent extraction of mineral resources through the deployment of technologies such as electrification of ground and underground mobility, remote controlling, automation or autonomous processes with a particular focus on historic mine sites and deep deposits. Actions should develop sustainable solutions through industrial and user-driven multidisciplinary consortia covering the relevant mining and processing value chains and technologies.</p><p><span><span>Proposals </span></span><span>should target minerals and metals and </span><span><span>can address individual elements of the raw materials value chain or the value chain as a whole, and should provide quantitative measures of the progress beyond the state of the art. Proposals are also required to seek end user involvement to drive the research with their requirements and test the developed solutions, with a clear path to the exploitation of the results. </span></span></p><p>Actions should facilitate the market uptake of solutions developed through industrially- and user-driven multidisciplinary consortia covering the relevant value chain and should consider standardisation aspects when relevant.</p><p><span>Proposals submitted under this topic should include a business case and exploitation strategy, as outlined in the introduction to this Destination. For TRLs 6-7, a credible strategy to achieve future full-scale manufacturing in the EU is expected, indicating the commitments of the industrial partners after the end of the project.</span></p><p>Actions should justify the relevance of selected pilot demonstrations in different locations within the EU (and also outside if there is a clear added value for the EU economy, industry and society).</p><p>The action should also contribute to improving the awareness of relevant external stakeholders and the general public across the EU about the importance of raw materials for society, the challenges related to their supply within the EU and about proposed solutions which could help to improve society's acceptance of and trust in sustainable raw materials production in the EU.</p><p>Actions should envisage clustering activities with other relevant selected projects for cross-projects co-operation, consultations and joint activities on cross-cutting issues and share of results as well as participating in joint meetings and communication events. To this end proposals should foresee a dedicated work package and/or task, and earmark the appropriate resources accordingly.</p><p><span>Proposals should take into account issues of accessibility and inclusivity, such as age, gender, disability, and socio-economic background.</span></p>", "date": "2022-06-27", "collection": "topic;Topic", "link_origin": "https://cordis.europa.eu/programme/rcn/706655", "other": {"crc": "c1e48cc51f9a1003e1c77fad0dfbc678b18d33eaf20427f68efb61b647ec45d8","project_piknus":"true"}}