{
  "source": "cordis",
  "mime_type": "URL",
  "language": "en",
  "id": "cordis:project:96955",
  "id_alias": "CORDIS:project:96955",
  "title": "ROBUST: Risk and Opportunity management of huge-scale BUSiness communiTy cooperation",
  "abstract": "Online communities generate major economic value and form pivotal parts of corporate expertise management, marketing, product support, CRM, product innovation and advertising. Communities can exceed millions of users and infrastructures must support hundreds of millions discu...",
  "text": "Online communities generate major economic value and form pivotal parts of corporate expertise management, marketing, product support, CRM, product innovation and advertising. Communities can exceed millions of users and infrastructures must support hundreds of millions discussion threads that link together billions of posts. Current solutions fail to meet current challenges of scale and growth, let alone support for understanding and managing the business, social and economic objectives of the users, providers and hosts involved. Extensive research into novel solutions is required to deal with both the large-scale data management and analysis tasks as well as to understand and manage complex user behaviors and ecosystems in online business communities.ROBUST will create models and methods for describing, understanding and managing the users, groups, behaviours and needs of online communities. A highly scalable cloud and stream-based data management infrastructure will handle the real time analysis of large volumes of community data. Simulation and visualisation services will support detailed understanding, prediction and exploration of possible actions. A risk management framework will combine these tools within a methodology for the detection, tracking and management of both opportunities and threats to online community prosperity.Live industrial testbeds from SAP and IBM provide practical grounding and serve to assess project success. Applications include online communities in internet, extranet and intranet settings addressing customer support, knowledge sharing, and hosting services. The variety of testbeds will ensure generality of our approach as well as place stringent requirements on data volumes, scalability and real-time analysis. A virtual centre of excellence will promote the project results and stimulate engagement with the wider community. An exploitation strategy targeted at widespread take-up and use will assure long-term sustainability.",
  "date": "2019-08-01",
  "author": [
    "NATIONAL UNIVERSITY OF IRELAND GALWAY",
    "EXPERT SYSTEM FRANCE",
    "SAP SE",
    "TECHNISCHE UNIVERSITAT BERLIN",
    "UNIVERSITY OF SOUTHAMPTON",
    "MeaningMine Ltd",
    "UNIVERSITAET KOBLENZ-LANDAU",
    "THE OPEN UNIVERSITY",
    "IBM ISRAEL - SCIENCE  AND TECHNOLOGY LTD",
    "SOFTWARE MIND SA"
  ],
  "collection": "project;Project",
  "link_origin": "https://cordis.europa.eu/project/rcn/96955",
  "other": {
    "crc": "23503bc56484fe346a60ea3a0b888d5ea41e8d393bad391e8ebdddf5f0832c92",
    "project_piknus": "true"
  }
}